wegam/STM32F1xWorkSpace/Driver/Components/SCR/LCD.c
	unsigned short	MaxV,MaxH;	//边界值
	unsigned short	i=0;				//显示
	char	DataBuffer[256]={0};			//记录format内码
  unsigned char CodeBuffer[130]={0};
	//1)**********获取数据宽度
	u16 InputDataSize=strlen((const char*)format);		//获取数据宽度	
	
	//3)**********args为定义的一个指向可变参数的变量，va_list以及下边要用到的va_start,va_end都是是在定义，可变参数函数中必须要用到宏， 在stdarg.h头文件中定义
	va_list args; 
	//5)**********初始化args的函数，使其指向可变参数的第一个参数，format是可变参数的前一个参数
	va_start(args, format);
	//6)**********正常情况下返回生成字串的长度(除去\0),错误情况返回负值
	vsnprintf(DataBuffer, InputDataSize+1,format, args);

	//7)**********结束可变参数的获取
	va_end(args);                                      		

	switch(LCDSYS->Flag.Rotate)
	{
		case Draw_Rotate_90D:
			MaxV	=	LCDSYS->Data.MaxH;
			MaxH	=	LCDSYS->Data.MaxV;
			break;
		case Draw_Rotate_180D:
			MaxV	=	LCDSYS->Data.MaxV;
			MaxH	=	LCDSYS->Data.MaxH;
			break;
		case Draw_Rotate_270D:
			MaxV	=	LCDSYS->Data.MaxH;
			MaxH	=	LCDSYS->Data.MaxV;
			break;
		default:
			MaxV	=	LCDSYS->Data.MaxV;
			MaxH	=	LCDSYS->Data.MaxH;
			break;
	}	
	for(i=0;i<InputDataSize;i++)
	{ 
		unsigned char GetBufferLength	=	0;
		unsigned char dst=DataBuffer[i];
		//=====================双字节--汉字
		if(dst>0x80)
		{
			u16 word=dst<<8;
      
			dst=DataBuffer[i+1];
			word=word|dst;			
			//显示超限判断
			if(font==12)
			{
				if(x>MaxH-12)
				{
					x=0;
					y+=12;
				}
				if(y>MaxV-12)
				{
					y=x=0;
				}
			}
			else if(font==16)
			{
				if(x>MaxH-16)
				{
					x=0;
					y+=16;
				}
				if(y>MaxV-16)
				{
					y=x=0;
				}
			}
			else if(font==24)
			{
				if(x>MaxH-24)
				{
					x=0;
					y+=24;
				}
				if(y>MaxV-24)
				{
					y=x=0;
				}
			}
			else if(font==32)
			{
				if(x>MaxH-32)
				{
					x=0;
					y+=32;
				}
				if(y>MaxV-32)
				{
					y=x=0;
				}
			}
			else
			{

			}
			GetBufferLength	=	GT32L32_ReadCode(font,word,CodeBuffer);		//从字库中读数据并返回数据长度
			//写入屏幕
			LCD_ShowWord(x,y,font,GetBufferLength,CodeBuffer);
			//显示地址增加	
			if(font==12)
			{
				x+=12;
			}
			else if(font==16)
			{
				x+=16;
			}
			else if(font==24)
			{
				x+=24;
			}
			else if(font==32)
			{
				x+=32;
			}
			i++;		//双字节，减两次
		}
		//=====================单字节--ASCII字符集
		else
		{			
			//显示超限判断
			if(font==12)
			{
				if(x>MaxH-12)
				{
					x=0;
					y+=12;
				}
				if(y>MaxV-12)
				{
					y=x=0;
				}
			}
			if(font==16)
			{
				if(x>MaxH-8)
				{
					x=0;
					y+=16;
				}
				if(y>MaxV-16)
				{
					y=x=0;
				}
			}
			if(font==24)
			{
				if(x>MaxH-24)
				{
					x=0;
					y+=24;
				}
				if(y>MaxV-24)
				{
					y=x=0;
				}
			}
			if(font==32)
			{
				if(x>MaxH-32)
				{
					x=0;
					y+=32;
				}
				if(y>MaxV-32)
				{
					y=x=0;
				}
			}
			GetBufferLength	=	GT32L32_ReadCode(font,(u16)dst,CodeBuffer);		//从字库中读数据并返回数据长度
//			//写入屏幕
			LCD_ShowChar(x,y,font,GetBufferLength,CodeBuffer);
			//显示地址增加
			if(font==12)
			{
				x+=6;
			}
			else if(font==16)
			{
				x+=8;
			}
			else if(font==24)
			{
				x+=12;
			}
			else if(font==32)
			{
				x+=16;
			}			
		}
	}
	return InputDataSize;
}








/**************************************************************************************************
* [Function] LCD_DrawPixelEx:  函数功能、注意事项等的描述
* [param01]u16 x: description
* [param02]u16 y: description
* [param03]u16 color: description
**************************************************************************************************/
void LCD_DrawPixelEx( u16 x, u16 y, u16 color )
{
	LCD_DrawDot(x,y,color);		//画点
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void LCD_Delay(u32 xms)
{
	while(xms--);
}

//#endif//LCD_61509_EN
/************************************** The End Of FILE **************************************/


